"""
파일명: Ex02-00-summary.py

변수 - 값을 담을수 있는 메모리 저장 공간

변수명 = 값

변수타입

기본형
    1. 부울(bool), 논리형변수 - True, False
        예) 부울변수1 = True
    2. 정수(int) - 음수, 0, 양수
        예) num1 = 10
    3. 실수(float) - 소수점 포함 숫자
        예) pi = 3.141592
    4. 문자열(str) - 문자열 저장 쌍따옴표(") 또는 작은따옴표(')
        예) str1 = "Hello, Python"
            str2 = '안녕하세요!'

컬렉션형(자료구조형)
    1. list - 순서가 있는 데이터 집합
        예) list1 = ['값1', '값2', '값3'... , '값n']
            list2 = ['값1', '값1', '값3'... , '값n']
    2. tuple - list 비슷하지만 수정 불가능
        예) tuple1 = ('값1', '값2', '값3'... , '값n')
    3. set - 순서가 없고, 중복허용하지 않는 데이터 집합
        예) set1 = {'값1', '값2', '값3'... , '값n'}
    4. dict - 키와 값 쌍으로 저장
        예) dict1 = {'name': '홍길동', 'age': 25}

    5. range(10) - 연속된 숫자를 만들어준다
        예) range(10) => 0, 1, 2, 3, 4, 5, 6, 7, 8, 9



"""











