"""
파일명: Ex08-02-nested-loop.py

중첩 반복문
    반복문 안에 반복문
"""

i = 0
while i < 7:
    '''
    i = 0
    j = 0, 1, 2, 3, 4, 5, 6
    
    i = 1
    j = 0, 1, 2, 3, 4, 5, 6
    .
    .
    .
    i = 7 -> 종료
    '''
    j = 0
    while j < 7:
        print('*', end = '')
        j += 1

    print()
    i += 1

print('==================================================================')

while i < 7:
    '''
    i = 0
    j = 0, 1

    i = 1
    j = 0, 1, 2
    .
    .
    .
    i = 7 -> 종료
    '''
    j = 0
    while j < i+1:
        print('*', end='')
        j += 1

    print()
    i += 1